BaseConfiguration/Money_2_0/Catalogs/Валюты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Валюты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружаетсяИзИнтернета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПрописиНаРусском</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиКурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиКурсаВалюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаРасчетаКурса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяВалюта</Name>
					<Comment>Валюта, по отношению к которой хранится курс</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ВариантыБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВариантыБюджетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальностьПланирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМесяца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДетальностиПланирования</Name>
					<Comment>(Инф.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ФинансовыеЦели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФинансовыеЦели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеФинансовойЦели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНакопления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/Валюты/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Конец ДЕНЬГИ


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// Возвращает реквизиты объекта, которые разрешается редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив Из Строка
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("СпособУстановкиКурса");
	Результат.Добавить("Наценка");
	Результат.Добавить("ОсновнаяВалюта");
	Результат.Добавить("ФормулаРасчетаКурса");
	Возврат Результат;
	
КонецФункции

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

#КонецОбласти

// ДЕНЬГИ

// Проверяет наличие основных валют, при необхдимости создает их
//
//Параметры:
//	нет
//
Процедура ПроверитьНаличиеОсновныхВалют() Экспорт
	
	Список = СписокОсновныхВалют();
	Для каждого КлючИЗначение Из Список Цикл
		НайтиСоздатьВалюту(КлючИЗначение.Ключ, 
						КлючИЗначение.Значение.Наименование, 
						КлючИЗначение.Значение.НаименованиеПолное, 
						КлючИЗначение.Значение.ПараметрыПрописи, 
						КлючИЗначение.Значение.ЗагружаетсяИзИнтернета);
	КонецЦикла;
	
КонецПроцедуры


// Проверяет и при необходимости устанавливает значение константы ВалютаУчета
//
//Параметры:
//	Код - Строка - код валюты, которую нужно назначить валютой учета, если константа пустая
//
Процедура ПроверитьВалютуУчета(Код) Экспорт
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если ЗначениеЗаполнено(ВалютаУчета) И ОбщегоНазначения.СсылкаСуществует(ВалютаУчета) Тогда
		Возврат;
	КонецЕсли;
	
	ВалютаУчета = Справочники.Валюты.НайтиПоКоду(Код);
	Если Не ЗначениеЗаполнено(ВалютаУчета) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось назначить валюту учета: не найдена валюта с кодом ""%1""'"), Код);
	КонецЕсли;
	
	Константы.ВалютаУчета.Установить(ВалютаУчета);
	
КонецПроцедуры

// Проверяет наличие начальных курсов для всех валют в справочнике
//
//Параметры:
//	НачальнаяДата - Дата или Неопределено - дата, на которую должны быть установлены начальные курсы.
//					по умолчанию - '1980.01.01'
//
Процедура ПроверитьНачальныеКурсыВалют(Знач НачальнаяДата = Неопределено) Экспорт
	
	НачальнаяДата = ?(ЗначениеЗаполнено(НачальнаяДата), НачальнаяДата, Дата(1980,1,1));
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Если Не ЗначениеЗаполнено(ВалютаУчета) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Не удалось проверить начальные курсы валют на дату %1: в программе не задана валюта учета!'"), 
							НачальнаяДата);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачальнаяДата", НачальнаяДата);
	Запрос.УстановитьПараметр("ВалютаУчета", НачальнаяДата);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	КурсыВалютСрезПервых.Курс КАК Курс,
	|	КурсыВалютСрезПервых.Кратность КАК Кратность
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПервых(&НачальнаяДата, БазоваяВалюта = &ВалютаУчета) КАК КурсыВалютСрезПервых
	|		ПО Валюты.Ссылка = КурсыВалютСрезПервых.Валюта
	|			И (КурсыВалютСрезПервых.Валюта = &ВалютаУчета)
	|ГДЕ
	|	(ЕСТЬNULL(КурсыВалютСрезПервых.Курс, 0) = 0
	|			ИЛИ ЕСТЬNULL(КурсыВалютСрезПервых.Кратность, 0) = 0)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		Запись.Валюта          = Выборка.Ссылка;
		Запись.БазоваяВалюта   = ВалютаУчета;
		Запись.Период          = НачальнаяДата;
		Запись.Курс            = 1;
		Запись.Кратность       = 1;
		Запись.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры


// Функция создает элемент справочника Валюты, если такого нет.
//
// Параметры:
//  Код -                 - значение соответствующего реквизита справочника,
//  Наименование          - значение соответствующего реквизита справочника,
//  НаименованиеПолное    - значение соответствующего реквизита справочника,
//  ПараметрыПрописи      - значение соответствующего реквизита справочника.
//
// Возвращаемое значение:
//  Ссылка на добавленный или существующий элемент.
//
Функция НайтиСоздатьВалюту(Код, Наименование, НаименованиеПолное, ПараметрыПрописи, ЗагружаетсяИзИнтернета = Ложь) Экспорт

	Ссылка = Справочники.Валюты.НайтиПоКоду(Код);

	Если Ссылка.Пустая() Тогда

		СправочникОбъект = Справочники.Валюты.СоздатьЭлемент();
		СправочникОбъект.Заполнить(Неопределено);

		СправочникОбъект.Код                       = Код;
		СправочникОбъект.Наименование              = Наименование;
		СправочникОбъект.НаименованиеПолное        = НаименованиеПолное;
		СправочникОбъект.ПараметрыПрописи          = ПараметрыПрописи;
		СправочникОбъект.Активность                = Истина;
		СправочникОбъект.ЗагружаетсяИзИнтернета    = ЗагружаетсяИзИнтернета;
		СправочникОбъект.СпособУстановкиКурса      = ?(Не ЗагружаетсяИзИнтернета, 
					Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод,
					Перечисления.СпособыУстановкиКурсаВалюты.ЗагрузкаИзИнтернета);
		
		СправочникОбъект.ДополнительныеСвойства.Свойство("НеПроверятьКурсы");
		ОбщегоНазначенияДеньги.ЗаписатьСсылочныйОбъект(СправочникОбъект, Истина);
		
		Ссылка = СправочникОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат Ссылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КодыВалют() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка,
	|	Валюты.Наименование КАК СимвольныйКод
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.СпособУстановкиКурса <> ЗНАЧЕНИЕ(Перечисление.СпособыУстановкиКурсаВалюты.НаценкаНаКурсДругойВалюты)
	|	И Валюты.СпособУстановкиКурса <> ЗНАЧЕНИЕ(Перечисление.СпособыУстановкиКурсаВалюты.РасчетПоФормуле)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// ДЕНЬГИ

Функция СписокОсновныхВалют() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("643", Новый Структура("Наименование, НаименованиеПолное, ПараметрыПрописи, ЗагружаетсяИзИнтернета",
		"руб.", "Российский рубль", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2", Ложь));
	Результат.Вставить("840", Новый Структура("Наименование, НаименованиеПолное, ПараметрыПрописи, ЗагружаетсяИзИнтернета",
		"USD", "Доллар США", "доллар, доллара, долларов, м, цент, цента, центов, м, 2", Истина));
	Результат.Вставить("978", Новый Структура("Наименование, НаименованиеПолное, ПараметрыПрописи, ЗагружаетсяИзИнтернета",
		"EUR", "Евро", "евро, евро, евро, м, цент, цента, центов, м, 2", Истина));
	
	Возврат Результат;
	
КонецФункции 
// Начальное заполнение элементов справочника. Вызывается при обновлении ИБ
//
Процедура ПриНачальномЗаполненииЭлементов() Экспорт
	
	Если ДеньгиВызовСервераПовтИсп.РежимИспользованияПриложения() = "Неразделенный" Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНаличиеОсновныхВалют();
	ПроверитьВалютуУчета("643");
	ПроверитьНачальныеКурсыВалют();
	
	ОтменитьРегистрациюВПланеОбмена("МобильноеПриложение");
	Если ОбщегоНазначения.ПодсистемаСуществует("ФункционалКонфигурацииДеньги.ОбменСЦентральнойБазой") Тогда
		ОтменитьРегистрациюВПланеОбмена("СинхронизацияАвтономныхКопий");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтменитьРегистрациюВПланеОбмена(ИмяПлана)
	
	УзлыОбмена = ПланыОбмена[ИмяПлана].ПолучитьИспользуемыеУзлыПланаОбмена();
	Если УзлыОбмена.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Справочники.Валюты);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.РегистрыСведений.КурсыВалют);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзлыОбмена, Метаданные.Константы.ВалютаУчета);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет в справочниках ссылки на "пустые" валюты и заменяет их на валюту учета
Процедура ПроверитьСсылкиВСправочниках() Экспорт
	
	Некорректные = НеокрректныеВалюты();
	Если Не ЗначениеЗаполнено(Некорректные) Тогда
		Возврат;
	КонецЕсли;
	
	Ошибка       = Неопределено;
	ОбъектОшибки = Неопределено; 
	
	Если Не ЗаменитьСсылкиВСправочниках(Некорректные, Ошибка, ОбъектОшибки) Тогда
		ЗаписьЖурналаРегистрации("Валюты", УровеньЖурналаРегистрации.Ошибка, 
			СтрШаблон(НСтр("ru='Не удалось заменить ссылку валюты в элементе справочника ""%1"":
			|%2'"), ОбъектОшибки, КраткоеПредставлениеОшибки(Ошибка)) );
		Возврат;
	КонецЕсли;
	
	СписокПомеченных = Неопределено;
	Если Не ПометитьВалютыНаУдаление(Некорректные, Ошибка, ОбъектОшибки, СписокПомеченных) Тогда
		ЗаписьЖурналаРегистрации("Валюты", УровеньЖурналаРегистрации.Ошибка, 
			СтрШаблон(НСтр("ru='Не удалось пометить на удаление валюту ""%1"":
			|%2'"), ОбъектОшибки, КраткоеПредставлениеОшибки(Ошибка)) );
		Возврат;
	КонецЕсли;
	
	УдалитьВалютыСПроверкой(СписокПомеченных);
	
КонецПроцедуры

Функция НеокрректныеВалюты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	Валюты.Код = """"
	|	И Валюты.Наименование = """"";
	
	СисокВалют = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат СисокВалют;
	
КонецФункции

Функция ЗаменитьСсылкиВСправочниках(Некорректные, Ошибка, ОбъектОшибки)
	
	ПроверитьВалютуУчета("643");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Некорректные", Некорректные);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВалютаУчета.Значение КАК Значение
	|ИЗ
	|	Константа.ВалютаУчета КАК ВалютаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.Валюта КАК Валюта
	|ИЗ
	|	Справочник.ВариантыБюджетов КАК Спр
	|ГДЕ
	|	Спр.Валюта.Наименование ЕСТЬ NULL
	|	ИЛИ Спр.Валюта В (&Некорректные)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Спр.Ссылка КАК Ссылка,
	|	Спр.Валюта КАК Валюта
	|ИЗ
	|	Справочник.ФинансовыеЦели КАК Спр
	|ГДЕ
	|	Спр.Валюта.Наименование ЕСТЬ NULL
	|	ИЛИ Спр.Валюта В (&Некорректные)
	|";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Выборка.Следующий();
	ВалютаУчета = Выборка.Значение;

	УзлыМУ = СинхронизацияАвтономныхКопий.ВсеУзлыПланаОбмена("МобильноеПриложение", Истина);
	УзлыАК = СинхронизацияАвтономныхКопий.ВсеУзлыПланаОбмена("СинхронизацияАвтономныхКопий", Истина);
	
	ВыборкаБюджета = РезультатыЗапроса[1].Выбрать();
	Пока ВыборкаБюджета.Следующий() Цикл
		
		Попытка
			
			СпрОбъект = ВыборкаБюджета.Ссылка.ПолучитьОбъект();
			СпрОбъект.Валюта = ВалютаУчета;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
			
			ЗарегистрироватьИзмененияДляУзлов(УзлыМУ, СпрОбъект);
			ЗарегистрироватьИзмененияДляУзлов(УзлыАК, СпрОбъект);
			
		Исключение
			Ошибка       = ОписаниеОшибки();
			ОбъектОшибки = СпрОбъект;
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	 
	ВыборкаФинцелей = РезультатыЗапроса[2].Выбрать();
	Пока ВыборкаФинцелей.Следующий() Цикл
		
		Попытка
			
			СпрОбъект = ВыборкаФинцелей.Ссылка.ПолучитьОбъект();
			СпрОбъект.Валюта = ВалютаУчета;
			СпрОбъект.ОбменДанными.Загрузка = Истина;
			СпрОбъект.Записать();
			
			ЗарегистрироватьИзмененияДляУзлов(УзлыМУ, СпрОбъект);
			ЗарегистрироватьИзмененияДляУзлов(УзлыАК, СпрОбъект);
		
		Исключение
			Ошибка       = ОписаниеОшибки();
			ОбъектОшибки = СпрОбъект;
			Возврат Ложь;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗарегистрироватьИзмененияДляУзлов(УзелПланаОбмена, Изменение)
	
	Если ЗначениеЗаполнено(УзелПланаОбмена) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(УзелПланаОбмена, Изменение);
	КонецЕсли;
	
КонецПроцедуры


Функция ПометитьВалютыНаУдаление(Список, Ошибка, ОбъектОшибки, СписокПомеченных)
	
	СписокПомеченных = Новый Массив;
	
	Для каждого Валюта Из Список Цикл
		
		СпрОбъект = Валюта.ПолучитьОбъект();
		Если СпрОбъект = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			СпрОбъект.ДополнительныеСвойства.Вставить("НеПроверятьКурсы", Истина);
			СпрОбъект.УстановитьПометкуУдаления(Истина);
			СписокПомеченных.Добавить(Валюта);
		Исключение
			
			Ошибка       = ОписаниеОшибки();
			ОбъектОшибки = СпрОбъект;
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция УдалитьВалютыСПроверкой(СписокПомеченных)
	
	Попытка
		РезультатУдаления = УдалениеПомеченныхОбъектов.УдалитьПомеченныеОбъекты(СписокПомеченных, "Стандартный");
	Исключение
		ОписаниеПроблемы = СтрШаблон(НСтр("ru='Не удалось удалить валюты, помеченные на удаление:
			|%1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("Валюты", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеПроблемы);
		Возврат Ложь;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(РезультатУдаления.НеУдаленные) Тогда
		ОписаниеПроблемы = СтрШаблон(НСтр("ru='Не удалось удалить валюты, помеченные на удаление, в количестве: %1'"), 
			РезультатУдаления.НеУдаленные.Количество());
		ЗаписьЖурналаРегистрации("Валюты", УровеньЖурналаРегистрации.Предупреждение,,, ОписаниеПроблемы);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Конец ДЕНЬГИ



#КонецОбласти

#КонецЕсли
